In [2]:
%pylab
import pandas as pd

Using matplotlib backend: Qt5Agg
Populating the interactive namespace from numpy and matplotlib

In [3]:
data=arange(100)

In [7]:
data=data.reshape(20,5)

In [12]:
df = pd.DataFrame(data,columns=list("abcde"),index=[_+1 for _ in range(len(data))])

In [14]:
df.head()

    a   b   c   d   e
1   0   1   2   3   4
2   5   6   7   8   9
3  10  11  12  13  14
4  15  16  17  18  19
5  20  21  22  23  24

# Rename colunms

In [15]:
df.columns=list("abcde".upper())

In [17]:
df.head()

    A   B   C   D   E
1   0   1   2   3   4
2   5   6   7   8   9
3  10  11  12  13  14
4  15  16  17  18  19
5  20  21  22  23  24

In [18]:
df.describe()

               A          B          C          D          E
count  20.000000  20.000000  20.000000  20.000000  20.000000
mean   47.500000  48.500000  49.500000  50.500000  51.500000
std    29.580399  29.580399  29.580399  29.580399  29.580399
min     0.000000   1.000000   2.000000   3.000000   4.000000
25%    23.750000  24.750000  25.750000  26.750000  27.750000
50%    47.500000  48.500000  49.500000  50.500000  51.500000
75%    71.250000  72.250000  73.250000  74.250000  75.250000
max    95.000000  96.000000  97.000000  98.000000  99.000000

In [19]:
df.rename(columns=lambda x: x+"@",inplace=True)

In [21]:
df.tail()

    A@  B@  C@  D@  E@
16  75  76  77  78  79
17  80  81  82  83  84
18  85  86  87  88  89
19  90  91  92  93  94
20  95  96  97  98  99

In [22]:
df.rename(columns=lambda x:x[::-1],inplace=True)

In [23]:
df.head()

   @A  @B  @C  @D  @E
1   0   1   2   3   4
2   5   6   7   8   9
3  10  11  12  13  14
4  15  16  17  18  19
5  20  21  22  23  24

In [24]:
df.rename(columns=lambda x:x.replace('@','!'),inplace=True)

In [26]:
df.head()

   !A  !B  !C  !D  !E
1   0   1   2   3   4
2   5   6   7   8   9
3  10  11  12  13  14
4  15  16  17  18  19
5  20  21  22  23  24

In [28]:
df.rename(columns=lambda x:x[1:],inplace=True)

# search,query

In [30]:
print(df.loc[df['A']==5])

   A  B  C  D  E
2  5  6  7  8  9

In [32]:
print(df.loc[df['B'].isin([6,11])])

    A   B   C   D   E
2   5   6   7   8   9
3  10  11  12  13  14

In [33]:
df[df.A==0]

   A  B  C  D  E
1  0  1  2  3  4

In [34]:
df[df.A.isin([0,5])]

   A  B  C  D  E
1  0  1  2  3  4
2  5  6  7  8  9

In [35]:
df[(df.A==0) | (df.C==12)]

    A   B   C   D   E
1   0   1   2   3   4
3  10  11  12  13  14

In [36]:
df.query('A==0 | D==8')

   A  B  C  D  E
1  0  1  2  3  4
2  5  6  7  8  9